## ***introduction to pandas***

In [ ]:
#creating a simple python list
a=[1,4,3,7,2,6,3]
a

[1, 4, 3, 7, 2, 6, 3]

In [ ]:
# Now lets convert it into pandas object called a series
import pandas as pd
a=pd.Series(a)
a

0    1
1    4
2    3
3    7
4    2
5    6
6    3
dtype: int64

In [ ]:
type(a)

pandas.core.series.Series

Simple series operations such as sorting,max,min,sum,count

In [ ]:
a.min()

1

In [ ]:
a.max()

7

In [ ]:
a.sort_values()

0    1
4    2
2    3
6    3
1    4
5    6
3    7
dtype: int64

In [ ]:
a.sort_values(ascending=False,inplace=True)

In [ ]:
a.value_counts()

3    2
7    1
6    1
4    1
2    1
1    1
dtype: int64

In [ ]:
data={
    'apples':[3,2,0,1],
    'orange':[3,2,0,1]
}

In [ ]:
purchases=pd.DataFrame(data)
purchases

   apples  orange
0       3       3
1       2       2
2       0       0
3       1       1

In [ ]:
purchases=pd.DataFrame(data,index=['Dhoni','Varsha','Thanu','Abhi'])
purchases

        apples  orange
Dhoni        3       3
Varsha       2       2
Thanu        0       0
Abhi         1       1